In [1]:
import pandas as pd
import numpy as np #For future use

In [11]:
nf_series=pd.Series([1,2,3,47,"Dog"],index=["a","b","c","d","e"])
nf_series

a      1
b      2
c      3
d     47
e    Dog
dtype: object

In [12]:
nf_series=pd.Series({"a":23,"b":26,"c":30})
nf_series

a    23
b    26
c    30
dtype: int64

In [13]:
df_7=pd.DataFrame({"Name":["A","B","C"],"Age":[23,34,45],"Result":["Pass","Pass","Fail"]},index=["a","b","c"])
df_7

  Name  Age Result
a    A   23   Pass
b    B   34   Pass
c    C   45   Fail

In [15]:
df_7.drop("a")

  Name  Age Result
b    B   34   Pass
c    C   45   Fail

In [16]:
df_7.drop("b")

  Name  Age Result
a    A   23   Pass
c    C   45   Fail

In [17]:
df_7.drop("c")

  Name  Age Result
a    A   23   Pass
b    B   34   Pass

In [18]:
df_7.drop(["Name","Result"],axis=0)

KeyError: "['Name' 'Result'] not found in axis"

In [19]:
df_7.drop(["Name","Result"],axis=1)

   Age
a   23
b   34
c   45

In [20]:
df_7.drop(["Name","Result"],axis=-1)

ValueError: No axis named -1 for object type DataFrame

In [21]:
df_7.drop(["Name","Age","Result"],axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c]

In [22]:
df_7.drop("a",inplace=True)

In [23]:
df_7

  Name  Age Result
b    B   34   Pass
c    C   45   Fail

In [25]:
df_7.drop("a",inplace=True)
df_7.drop("b",inplace=False)

KeyError: "['a'] not found in axis"

In [26]:
df_7.drop("a",inplace=False)

KeyError: "['a'] not found in axis"

In [27]:
df_7.drop("b",inplace=True)

In [28]:
df_7

  Name  Age Result
c    C   45   Fail

In [29]:
df_7.drop("c",inplace=True)

In [30]:
df_7

Empty DataFrame
Columns: [Name, Age, Result]
Index: []

In [31]:
df_7.drop("Name",axis=1,inplace=True)

In [32]:
df_7

Empty DataFrame
Columns: [Age, Result]
Index: []

In [33]:
df_7.drop("Name",axis=0,inplace=True)

KeyError: "['Name'] not found in axis"

In [35]:
df_7.drop("Age",axis=1,inplace=True)

In [36]:
df_7

Empty DataFrame
Columns: [Result]
Index: []

In [37]:
df_7.drop("Result",axis=1,inplace=True)

In [38]:
df_7

Empty DataFrame
Columns: []
Index: []

In [41]:
d_7={"Name":["Sam","Jane","Kane"],"Mark1":[12,45,56],"Mark2":[56,67,78],"Mark3":[67,78,89]}
df_7=pd.DataFrame(d_7)
df_7

   Name  Mark1  Mark2  Mark3
0   Sam     12     56     67
1  Jane     45     67     78
2  Kane     56     78     89

In [42]:
df_7.sort_values(by="Mark1",ascending=True)

   Name  Mark1  Mark2  Mark3
0   Sam     12     56     67
1  Jane     45     67     78
2  Kane     56     78     89

In [43]:
df_7.sort_values(by="Mark1",ascending=False)

   Name  Mark1  Mark2  Mark3
2  Kane     56     78     89
1  Jane     45     67     78
0   Sam     12     56     67

In [46]:
df_7.sort_values(by="Mark2",ascending=True)

   Name  Mark1  Mark2  Mark3
0   Sam     12     56     67
1  Jane     45     67     78
2  Kane     56     78     89

In [47]:
df_7.sort_values(by="Mark2",ascending=False)

   Name  Mark1  Mark2  Mark3
2  Kane     56     78     89
1  Jane     45     67     78
0   Sam     12     56     67

In [48]:
df_7.sort_values(by="Mark3",ascending=True)

   Name  Mark1  Mark2  Mark3
0   Sam     12     56     67
1  Jane     45     67     78
2  Kane     56     78     89

In [49]:
df_7.sort_values(by="Mark3",ascending=False)

   Name  Mark1  Mark2  Mark3
2  Kane     56     78     89
1  Jane     45     67     78
0   Sam     12     56     67

In [50]:
df_7.sort_values(by="Mark1",descending=True)

TypeError: sort_values() got an unexpected keyword argument 'descending'

In [52]:
df_7.sort_values(by="Mark1",descending=False)

TypeError: sort_values() got an unexpected keyword argument 'descending'

In [55]:
g=df_7.groupby("Mark2")

In [56]:
list(g)

[(56,
    Name  Mark1  Mark2  Mark3
  0  Sam     12     56     67),
 (67,
     Name  Mark1  Mark2  Mark3
  1  Jane     45     67     78),
 (78,
     Name  Mark1  Mark2  Mark3
  2  Kane     56     78     89)]

In [57]:
g=df_7.groupby("Mark1")

In [58]:
list(g)

[(12,
    Name  Mark1  Mark2  Mark3
  0  Sam     12     56     67),
 (45,
     Name  Mark1  Mark2  Mark3
  1  Jane     45     67     78),
 (56,
     Name  Mark1  Mark2  Mark3
  2  Kane     56     78     89)]

In [59]:
g=df_7.groupby("Mark3")

In [60]:
list(g)

[(67,
    Name  Mark1  Mark2  Mark3
  0  Sam     12     56     67),
 (78,
     Name  Mark1  Mark2  Mark3
  1  Jane     45     67     78),
 (89,
     Name  Mark1  Mark2  Mark3
  2  Kane     56     78     89)]

In [61]:
g=df_7.groupby("Mark1")
g=df_7.groupby("Mark2")
g=df_7.groupby("Mark3")

In [62]:
list(g)

[(67,
    Name  Mark1  Mark2  Mark3
  0  Sam     12     56     67),
 (78,
     Name  Mark1  Mark2  Mark3
  1  Jane     45     67     78),
 (89,
     Name  Mark1  Mark2  Mark3
  2  Kane     56     78     89)]

In [63]:
for i,j in g:
     print(j)
     print("****************************************")

  Name  Mark1  Mark2  Mark3
0  Sam     12     56     67
****************************************
   Name  Mark1  Mark2  Mark3
1  Jane     45     67     78
****************************************
   Name  Mark1  Mark2  Mark3
2  Kane     56     78     89
****************************************

In [65]:
df_7.groupby("Mark2").sum()

       Mark1  Mark3
Mark2
56        12     67
67        45     78
78        56     89

In [66]:
df_7.groupby("Mark1").sum()

       Mark2  Mark3
Mark1
12        56     67
45        67     78
56        78     89

In [67]:
df_7.groupby("Mark3").sum()

       Mark1  Mark2
Mark3
67        12     56
78        45     67
89        56     78

In [68]:
df_7.groupby("Mark1").mean()

       Mark2  Mark3
Mark1
12        56     67
45        67     78
56        78     89

In [69]:
df_7.groupby("Mark2").mean()

       Mark1  Mark3
Mark2
56        12     67
67        45     78
78        56     89

In [70]:
df_7.groupby("Mark3").mean()

       Mark1  Mark2
Mark3
67        12     56
78        45     67
89        56     78

In [71]:
df_7.groupby("Mark1").median()

       Mark2  Mark3
Mark1
12        56     67
45        67     78
56        78     89

In [72]:
df_7.groupby("Mark2").median()

       Mark1  Mark3
Mark2
56        12     67
67        45     78
78        56     89

In [73]:
df_7.groupby("Mark3").median()

       Mark1  Mark2
Mark3
67        12     56
78        45     67
89        56     78

In [74]:
df_7.groupby("Name")["Mark1"].sum()

Name
Jane    45
Kane    56
Sam     12
Name: Mark1, dtype: int64

In [75]:
df_7.groupby("Name")["Mark2"].sum()

Name
Jane    67
Kane    78
Sam     56
Name: Mark2, dtype: int64

In [76]:
df_7.groupby("Name")["Mark3"].sum()

Name
Jane    78
Kane    89
Sam     67
Name: Mark3, dtype: int64

In [77]:
df_7.groupby("Name")["Mark1"].sum()
df_7.groupby("Name")["Mark2"].sum()
df_7.groupby("Name")["Mark3"].sum()

Name
Jane    78
Kane    89
Sam     67
Name: Mark3, dtype: int64

In [86]:
d_7={"Age":[23,34,45],"Name":["Sam","Jane","Kane"],"University":["UOC","UOP","UOK"],"Gender":["F","M","F"],"Marks":[67,78,89]}
df_7=pd.DataFrame(d_7)
df_7

   Age  Name University Gender  Marks
0   23   Sam        UOC      F     67
1   34  Jane        UOP      M     78
2   45  Kane        UOK      F     89

In [89]:
df_7.groupby(["University","Gender"]).agg(["mean","median","max","min"])

                   Age                Marks
                  mean median max min  mean median max min
University Gender
UOC        F        23     23  23  23    67     67  67  67
UOK        F        45     45  45  45    89     89  89  89
UOP        M        34     34  34  34    78     78  78  78

In [90]:
df_7.groupby(["University","Gender"]).mean()

                   Age  Marks
University Gender
UOC        F        23     67
UOK        F        45     89
UOP        M        34     78

In [91]:
df_7.groupby(["University","Gender"]).median()

                   Age  Marks
University Gender
UOC        F        23     67
UOK        F        45     89
UOP        M        34     78

In [92]:
df_7.groupby(["University","Gender"]).min()

                   Age  Name  Marks
University Gender
UOC        F        23   Sam     67
UOK        F        45  Kane     89
UOP        M        34  Jane     78

In [93]:
df_7.groupby(["University","Gender"]).max()

                   Age  Name  Marks
University Gender
UOC        F        23   Sam     67
UOK        F        45  Kane     89
UOP        M        34  Jane     78

In [100]:
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])

In [101]:
df1

          A         B
0  0.127812  0.058116
1  0.740892  0.641275
2  0.355850  0.425800
3  0.926058  0.996146
4  0.143379  0.546140

In [102]:
df2

          A         B
0  0.495656  0.967593
1  0.264335  0.431131
2  0.145299  0.115900
3  0.952490  0.298856
4  0.609950  0.793143

In [103]:
newdf=pd.concat([df1,df2])
newdf

          A         B
0  0.127812  0.058116
1  0.740892  0.641275
2  0.355850  0.425800
3  0.926058  0.996146
4  0.143379  0.546140
0  0.495656  0.967593
1  0.264335  0.431131
2  0.145299  0.115900
3  0.952490  0.298856
4  0.609950  0.793143

In [104]:
newdf=pd.concat([df1,df2],axis=0)
newdf

          A         B
0  0.127812  0.058116
1  0.740892  0.641275
2  0.355850  0.425800
3  0.926058  0.996146
4  0.143379  0.546140
0  0.495656  0.967593
1  0.264335  0.431131
2  0.145299  0.115900
3  0.952490  0.298856
4  0.609950  0.793143

In [105]:
newdf=pd.concat([df1,df2],axis=1)
newdf

          A         B         A         B
0  0.127812  0.058116  0.495656  0.967593
1  0.740892  0.641275  0.264335  0.431131
2  0.355850  0.425800  0.145299  0.115900
3  0.926058  0.996146  0.952490  0.298856
4  0.143379  0.546140  0.609950  0.793143

In [120]:
df3=pd.DataFrame({"ID"=[1,2,7,8],"Val1":[23,56,77,90]})
df4=pd.DataFrame({"ID"=[3,4,5,6],"Val2":[45,65,89,95]})

SyntaxError: invalid syntax (<ipython-input-120-de9042184ea3>, line 1)